Repository: IsaacHuo/MyLeafy
Catalog: leafy/Localizable.xcstrings
Source language: zh_hans
Languages: en_us

source: 检查更新
en_us: Check for updates

source: 森林生态
en_us: forest ecology

source: 楼层情况
en_us: Floor information

source: 欢迎使用 %@
en_us: Welcome to %@

source: 欢迎使用 %arg
en_us: Welcome to %arg

source: 正在上：%@
en_us: Now playing: %@

source: 正在使用本地缓存，上次同步失败：%@
en_us: Using local cache, last sync failed: %@

source: 正在保存同步结果
en_us: Saving sync results

source: 正在保存成绩
en_us: Saving grades

source: 正在保存草稿…
en_us: Saving draft…

source: 正在保存课表
en_us: Saving schedule

source: 正在保存长图
en_us: Saving long image

source: 正在准备麦克风…
en_us: Preparing microphone…

source: 正在删除账户…
en_us: Deleting account...

source: 正在加载
en_us: Loading

source: 正在加载学校社区
en_us: Loading school community

source: 正在加载更多
en_us: Loading more

source: 正在加载社区身份
en_us: Loading community identity

source: 正在发送评论
en_us: Sending comment

source: 正在同步
en_us: Synchronizing

source: 正在同步社区身份
en_us: Syncing community identity

source: 正在同步课表
en_us: Syncing schedule

source: 正在处理培养方案
en_us: Processing training program

source: 正在处理成绩
en_us: Processing grades

source: 正在处理教学计划
en_us: Processing teaching plan

source: 正在处理考试安排
en_us: Processing exams

source: 正在处理课表
en_us: Processing schedule

source: 正在拉取培养方案
en_us: Fetching training program

source: 正在拉取官方排名
en_us: Fetching official rankings

source: 正在拉取已发布来源
en_us: Fetching published sources

source: 正在拉取成绩
en_us: Fetching grades

source: 正在拉取教学计划
en_us: Fetching teaching plan

source: 正在拉取考试安排
en_us: Fetching exam schedule

source: 正在拉取课表
en_us: Fetching schedule

source: 正在更新学期信息
en_us: Updating semester information

source: 正在更新官方排名
en_us: Official ranking is being updated

source: 正在查询官方排名
en_us: Querying official ranking

source: 正在查询强智官方排名
en_us: Querying the official ranking of Qiangzhi

source: 正在查询教室占用
en_us: Querying classroom occupancy

source: 正在查询空教室
en_us: Querying available classrooms

source: 正在生成图文卡片…
en_us: Generating graphic card...

source: 正在生成校园热力图
en_us: Generating campus heatmap

source: 正在识别验证码
en_us: Recognizing the verification code

source: 正在读取天气
en_us: Reading weather

source: 正在读取照片
en_us: Reading photo

source: 正在进入学校社区。
en_us: Entering the school community.

source: 正在连接教务系统
en_us: Connecting to the academic system

source: 正在连接教务系统…
en_us: Connecting to the academic system…

source: 正在验证登录
en_us: Verifying login

source: 正文
en_us: Main text

source: 正文（可选）
en_us: Main text (optional)

source: 正文引用了已不存在的图片或附件，请移除该标记后重试。
en_us: The body references an image or attachment that no longer exists. Remove its marker and try again.

source: 正文里的 #标签 和 #学习/Swift 会自动成为标签。
en_us: #Tags in the main text and #Study/Swift will automatically become tags.

source: 此共享演示账户受保护，不能删除。退出演示模式不会影响正式账户与数据。
en_us: This shared demo account is protected and cannot be deleted. Exiting demo mode will not affect the official account and data.

source: 此页面只处理通用入口的本机课表。北京林业大学入口请继续使用课表页右上角刷新教务课表。
en_us: This page only handles the local class schedule of the universal entrance. For Beijing Forestry University entrance, please continue to use the upper right corner of the schedule page to refresh the academic schedule.

source: 每 %arg 周为一组
en_us: Every %arg weeks as a group

source: 每 %lld 周为一组
en_us: Each %lld week is a group

source: 每个附件不超过 10 MB；附件会私密存储，下载时临时授权。
en_us: Each attachment no larger than 10 MB; attachments are stored privately and temporarily authorized for download.

source: 每位老师每个账号只保留一条评分记录。
en_us: Each teacher keeps only one rating record per account.

source: 每日回顾
en_us: Daily review

source: 每次最多导入 10 个文件。
en_us: Up to 10 files can be imported at a time.

source: 每组目标 %arg 次
en_us: Each group goal %arg times

source: 每组目标 %lld 次
en_us: Target %lld times per group

source: 每道菜每个账号只保留一条评分记录。
en_us: Each dish keeps only one rating record per account.

source: 每门课程每个账号只保留一条评分记录。
en_us: Each course keeps only one rating record per account.

source: 比前 30 天多 %d 条。
en_us: %d more note(s) than the previous 30 days.

source: 比前 30 天少 %d 条。
en_us: %d fewer note(s) than the previous 30 days.

source: 毕业进度
en_us: Graduation progress

source: 气温
en_us: Temperature

source: 永久删除
en_us: Permanently delete

source: 永久删除全部
en_us: Permanently delete all

source: 永久删除回收站中的全部随记？
en_us: Permanently delete all notes in the recycle bin?

source: 永久删除社区账户和当前设备上的 MyLeafy 数据
en_us: Permanently delete community account and MyLeafy data on the current device

source: 永久删除账户
en_us: Permanently delete account

source: 没有匹配的帖子
en_us: No matching posts

source: 没有可写入的系统日历。请先在系统日历中启用一个可写日历。
en_us: No writable system calendar found. Please enable a writable calendar in the system calendar first.

source: 没有可预览的长图
en_us: No long image available for preview

source: 没有找到可导入的文件。请使用 PDF、图片、Word 或 PPT 文件。
en_us: No files found to import. Please use PDF, image, Word, or PPT files.

source: 没有找到随记
en_us: No notes found

source: 没有相册保存权限，请在系统设置中允许 %@ 添加照片。
en_us: No album save permission, please allow %@ to add photos in the system settings.

source: 法律信息
en_us: Legal information

source: 注册
en_us: Sign Up

source: 浅色
en_us: Light

source: 测算对象
en_us: Measurement object

source: 测试日期
en_us: Test date

source: 深夜
en_us: Late night

source: 深色
en_us: Dark

source: 添加 %lld 张照片
en_us: Add %lld photo

source: 添加 PDF、Excel、Word 或 Markdown
en_us: Add PDF, Excel, Word, or Markdown

source: 添加一句备注（可选）
en_us: Add a note (optional)

source: 添加任务
en_us: Add task

source: 添加体测记录
en_us: Add physical test record

source: 添加共享课表
en_us: Add shared schedule

source: 添加内容
en_us: Add content

source: 添加岗位
en_us: Add position

source: 添加已选择的照片并返回随记
en_us: Add selected photos and return to notes

source: 添加成绩
en_us: add grade

source: 添加或导入成绩
en_us: Add or import grades

source: 添加提醒
en_us: Add reminder

source: 添加材料
en_us: Add material

source: 添加第 %arg 节日程
en_us: Add %arg holiday schedule

source: 添加第 %lld 节日程
en_us: Add schedule %lld

source: 添加考试
en_us: Add exam

source: 添加自定义提前量
en_us: Add custom lead time

source: 添加自定日程
en_us: Add custom schedule

source: 添加荣誉记录
en_us: Add honor record

source: 添加记录
en_us: Add record

source: 添加课程
en_us: Add course

source: 添加课程或导入文件后显示。
en_us: Display after adding course or importing file.

source: 添加选项
en_us: Add option

source: 清晨
en_us: Early morning

source: 清理
en_us: Clean

source: 清理中
en_us: Cleaning

source: 清理已导出课表事件
en_us: Clean exported schedule events

source: 清理已导出课表事件？
en_us: Clean exported schedule events?

source: 清空
en_us: Clear

source: 清空全部医疗台账？
en_us: Clear all medical ledgers?

source: 清空医疗台账
en_us: Clear medical ledgers

source: 清空当前本机课表数据
en_us: Clear current local schedule data

source: 清空当前通用入口本机课表？
en_us: Clear current general entry local schedule?

source: 清空搜索
en_us: Clear search

source: 清空本机课表数据
en_us: Clear local schedule data

source: 清除搜索
en_us: Clear search

source: 清除教务缓存
en_us: Clear academic cache

source: 清除本地缓存
en_us: Clear local cache

source: 清除筛选
en_us: Clear filters

source: 清除缓存
en_us: Clear cache

source: 清除评分
en_us: Clear scores

source: 温度
en_us: temperature

source: 滑动切换
en_us: Slide to switch

source: 满分目标已完成
en_us: The full score goal has been achieved

source: 点击右上角分享，可发送到聊天、动态或保存到相册。
en_us: Click the top right corner to share, you can send to chat, moments, or save to album.

source: 点击后立即开始计时，停止时保存为专注记录。
en_us: The timer starts immediately after clicking and is saved as a focus record when stopped.

source: 点按柱形查看当月记录情况。
en_us: Tap bars to view the record situation for the month.

source: 点赞
en_us: Like

source: 点赞前需要先完善社区资料。
en_us: You need to complete your community profile before liking.

source: 点进每一项，可以查看对应章节的详细说明。
en_us: Tap on each item to view detailed instructions for the corresponding chapter.

source: 照片
en_us: Photos

source: 照片图库
en_us: Photo gallery

source: 照片文件不可用，请重新选择。
en_us: The photo file is not available, please select again.

source: 版本
en_us: Version

source: 状态
en_us: Status

source: 状态与截止日
en_us: Status and deadline

source: 现在天气
en_us: Current weather

source: 班级或备注
en_us: Class or remarks

source: 生成于 %@
en_us: Generated in %@

source: 生成于 %arg
en_us: Generated on %arg

source: 生成图文卡片
en_us: Generate graphic card

source: 生成失败
en_us: Generation failed

source: 用途
en_us: Purpose

source: 由 %@ 导出
en_us: Exported by %@

source: 申请删除
en_us: Request deletion

source: 申请删除这个投票？
en_us: Request to delete this vote?

source: 申请新增学校
en_us: Request to add school

source: 申请通过后会自动进入对应学校社区。
en_us: You will automatically enter the school community once your application is approved.

source: 登录
en_us: Login

source: 登录会话未建立，请稍后重试。
en_us: The sign-in session could not be created. Try again later.

source: 登录失败，请稍后重试。
en_us: Sign-in failed. Please try again later.

source: 登录状态已失效，请连接校园网后重新登录
en_us: Login status has expired, please reconnect to the campus network and log in again.

source: 登录请求已发送，但未能确认登录成功。请重试；如果仍失败，把这条提示发给我。
en_us: Login request has been sent, but login success could not be confirmed. Please try again; if it still fails, send me this prompt.

source: 登录请求已发送，但未能确认登录成功。请重试。
en_us: Login request has been sent, but login success could not be confirmed. Please try again.

source: 登录身份
en_us: Login identity

source: 的周课表
en_us: 's weekly schedule

source: 的日程卡片
en_us: 's agenda card

source: 目前没有未通过课程
en_us: There are currently no unpassed courses

source: 目录
en_us: Directory

source: 目标
en_us: Target

source: 目标/备注
en_us: Target/Note

source: 目标只保存在本机，删除后无法恢复。
en_us: The target is only stored locally and cannot be restored once deleted.

source: 目标只保存在本机；公共来源来自官方或后台维护后的信息。
en_us: The target is only stored locally; public sources come from official or backend-maintained information.

source: 目标年份 %arg
en_us: Target year %arg

source: 目标年份 %lld
en_us: Target year %lld

source: 知道了
en_us: Got it

source: 研究生端暂未接入%@，当前先支持研究生登录和课表。
en_us: The graduate student portal has not yet integrated %@; currently, only graduate student login and class schedule are supported.

source: 确定
en_us: Confirm

source: 确认加入学校社区
en_us: Confirm Joining School Community

source: 确认加入这个学校社区？
en_us: Join this school community?

source: 确认清除教务缓存？
en_us: Confirm clearing the academic cache?

source: 确认清除本地缓存？
en_us: Confirm clearing local cache?

source: 确认记录
en_us: Confirm record

source: 确认退出？
en_us: Sign out?

source: 示例
en_us: Example

source: 社区
en_us: Community

source: 社区会话建立超时，请检查网络后重试。
en_us: Community session establishment timed out, please check the network and try again.

source: 社区内容加载失败，请重试。
en_us: Community content could not be loaded. Try again.

source: 社区安全与技术支持
en_us: Community Safety and Technical Support

source: 社区安全或不当活动也可邮件联系：%@
en_us: For community safety or inappropriate activities, you can also contact us by email: %@

source: 社区帖子加载超时，请检查网络后重试。
en_us: Community posts loading timed out, please check the network and try again.

source: 社区投票加载失败，请重试。
en_us: Community polls could not be loaded. Try again.

source: 社区投票加载超时，请检查网络后重试。
en_us: Community votes loading timed out, please check the network and try again.

source: 社区操作失败
en_us: Community operation failed

source: 社区操作失败，请稍后重试。
en_us: The community action failed. Please try again later.

source: 社区条款
en_us: Community Terms

source: 社区条约
en_us: Community Covenant

source: 社区诊断空壳
en_us: Community diagnostics placeholder

source: 社区资料
en_us: Community profile

source: 社区资料会和教务学号绑定，首次发帖或点赞前需要先完善昵称。头像、学院和年级可选。
en_us: The community profile will be linked to the academic student ID. You need to complete your nickname before posting or liking for the first time. Avatar, college, and grade are optional.

source: 社区资料暂不可用
en_us: Community information temporarily unavailable

source: 社区身份同步失败
en_us: Community identity sync failed

source: 社区身份尚未建立，请确认教务登录仍有效后重试。
en_us: Community identity has not been established, please confirm that your academic login is still valid and try again.

source: 社区身份已通过
en_us: Community identity verified

source: 离线阅读中文古典诗词
en_us: Offline reading of Chinese classical poetry

source: 科室
en_us: Department

source: 秒：%arg
en_us: Seconds: %arg

source: 秒：%lld
en_us: Seconds: %lld

source: 移入回收站的随记不会自动到期。
en_us: Notes moved to the recycle bin will not expire automatically.

source: 移到回收站
en_us: Move to recycle bin

source: 移到回收站？
en_us: Move to recycle bin?

source: 移除
en_us: Remove

source: 移除照片失败：%@
en_us: Failed to remove photo: %@

source: 移除附件
en_us: Remove attachment

source: 空教室查询来自学校教务系统，请连接校园网并保持教务登录态后再查询。
en_us: The empty classroom query comes from the school's academic affairs system. Please connect to the campus network and keep the academic affairs login status before querying.

source: 空教室页面未返回可解析的数据。%@
en_us: The empty classroom page did not return parsable data. %@

source: 空教室页面返回了登录页（%@ %d-%d节）。
en_us: The empty classroom page returned the login page (%@ %d-%d period).

source: 空闲教室
en_us: Available Classrooms

source: 空闲教室查询、图书馆座位预约和校园热力图集中在这里。
en_us: Find open rooms, reserve a library seat, or check building activity.

source: 空间名称
en_us: Space name

source: 第 %@ 周
en_us: Week %@

source: 第 %arg 周
en_us: Week %arg

source: 第 %arg 节开始前
en_us: Before the start of session %arg

source: 第 %d / %d 次课
en_us: Class %d / %d

source: 第 %d 周
en_us: Week %d

source: 第 %d 张帖子图片下载失败，请检查网络后重试。
en_us: Failed to download image %d of the post, please check your network and try again.

source: 第 %d 张帖子图片无法读取。
en_us: Unable to read image %d of the post.

source: 第 %d 节
en_us: Session %d

source: 第 %d-%d 周
en_us: Weeks %d-%d

source: 第 %d-%d 节
en_us: Periods %d-%d

source: 第 %lld 周
en_us: Week %lld

source: 第 %lld 节开始前
en_us: Before the start of section %lld

source: 第一次发帖前需要先完善社区资料。
en_us: You need to complete your community profile before posting for the first time.

source: 第一次记录
en_us: First record

source: 第一节：%@
en_us: First session: %@

source: 等待学校校历
en_us: Waiting for the school calendar

source: 等待选择照片
en_us: Waiting to select a photo

source: 筛选
en_us: Filter

source: 筛选与排序
en_us: Filter and sort

source: 筛选教师
en_us: Filter teachers

source: 筛选菜品
en_us: Filter dishes

source: 筛选话题
en_us: Filter topics

source: 筛选课程
en_us: Filter courses

source: 筛选选定时段空教室
en_us: Find rooms available at your chosen time.

source: 签名
en_us: Signature

source: 简历已删除。
en_us: Resume deleted.

source: 简历文件已替换。
en_us: Resume file replaced.

source: 管理本地数据
en_us: Manage local data

source: 类别
en_us: category

source: 类型
en_us: Type

source: 类型：日程
en_us: Type: Schedule

source: 类型：考试
en_us: Type: Exam

source: 粗体
en_us: Bold

source: 粗细
en_us: Thickness

source: 粘贴邀请码
en_us: Paste invitation code

source: 系统日历中没有本学期 %@ 已导出的课表事件。
en_us: There are no schedule events exported for this semester %@ in the system calendar.

source: 紧凑
en_us: Compact

source: 纯色
en_us: Solid color

source: 组织/公司
en_us: Organization/Company

source: 绑定邮箱
en_us: Bind email

source: 结束
en_us: End

source: 结束时间
en_us: End time

source: 结束时间必须晚于开始时间。
en_us: End time must be later than start time.

source: 结束时间需要晚于开始时间。
en_us: End time must be later than start time.

source: 结束节次
en_us: End period

source: 给 %@ 评分
en_us: Rate %@

source: 给 %arg 评分
en_us: Rate %arg

source: 统计在本机完成，导出图片只包含汇总数字。
en_us: Statistics are completed on this device; exported images only include summary numbers.

source: 统计指标
en_us: Statistical indicators

source: 统计按有效课程计算；成绩单列表仍保留期考、补考和重修记录。
en_us: Statistics are based on valid courses; the transcript list still retains midterm, make-up, and retake records.

source: 继续关注高学分课程和学期趋势。
en_us: Continue to monitor high-credit course and semester trends.

source: 继续删除
en_us: Continue to delete

source: 继续刷新成绩
en_us: Continue grade refresh

source: 继续刷新方案
en_us: Continue program refresh

source: 继续刷新考试
en_us: Continue exam refresh

source: 继续刷新计划
en_us: Continue plan refresh

source: 继续刷新课表
en_us: Continue schedule refresh

source: 继续同步
en_us: Continue sync

source: 继续更新数据
en_us: Continue data update

source: 继续查询
en_us: Continue query

source: 继续滑动加载更多
en_us: Continue scrolling to load more

source: 继续编辑
en_us: Continue editing

source: 综素测算
en_us: Comprehensive quality assessment

source: 综素测算暂不可用
en_us: Comprehensive quality assessment is temporarily unavailable

source: 缓存与同步
en_us: Caching and synchronization

source: 缓存状态
en_us: Cache status

source: 编号列表
en_us: Number list

source: 编辑
en_us: Edit

source: 编辑任务
en_us: Edit task

source: 编辑体测记录
en_us: Edit physical test records

source: 编辑写文
en_us: Edit and write

source: 编辑台账
en_us: Edit ledger

source: 编辑学习空间
en_us: Edit learning space

source: 编辑学习资料
en_us: Edit study materials

source: 编辑岗位
en_us: Editor position

source: 编辑录音备注
en_us: Edit recording notes

source: 编辑成绩
en_us: Edit grades

source: 编辑或删除这条成绩
en_us: Edit or delete this grade

source: 编辑模式
en_us: Edit mode

source: 编辑简历
en_us: Edit resume

source: 编辑考研目标
en_us: Edit postgraduate entrance examination objectives

source: 编辑考试
en_us: Edit exam

source: 编辑自定日程
en_us: Edit custom schedule

source: 编辑荣誉
en_us: Edit honors

source: 编辑记录
en_us: Edit records

source: 编辑资料
en_us: Edit profile

source: 编辑随记
en_us: Editor's note

source: 缩小编辑器
en_us: Reduce editor

source: 网络连接失败，请检查网络后重试。
en_us: The network connection failed. Check your connection and try again.

source: 置顶
en_us: Pin to top

source: 考研信息
en_us: Grad School

source: 考试
en_us: Exam

source: 考试 %@
en_us: Exam %@

source: 考试 %d 场
en_us: Exam %d session

source: 考试 %d 条
en_us: Exam %d item

source: 考试：%@
en_us: Exam: %@

source: 考试：%@ · %@
en_us: Exam: %@ · %@

source: 考试：%@ %@ %@ @ %@
en_us: Exam: %@ %@ %@ @ %@

source: 考试信息
en_us: Exam information

source: 考试名称
en_us: Exam name

source: 考试失败
en_us: Exam failed

source: 考试失败：%@
en_us: Exams failed: %@

source: 考试安排
en_us: Exam schedule

source: 考试安排已保存。
en_us: Exam schedule has been saved.

source: 考试安排已删除。
en_us: Exam schedule has been deleted.

source: 考试安排页面未返回可解析的数据。
en_us: Exam schedule page did not return parsable data.

source: 考试安排页面返回了登录页。
en_us: Exam schedule page returned to the login page.

source: 考试科目
en_us: Exam subjects

source: 职业规划
en_us: Career

source: 职业规划参考
en_us: Career planning reference

source: 职业规划操作失败
en_us: Career planning operation failed

source: 联系我们
en_us: Contact us

source: 联系方式（可选）
en_us: Contact information (optional)

source: 背景类型
en_us: Background type

source: 背景设置只保存在本机，只影响课表页；分享图和小组件会继续使用主题色。
en_us: Background settings are only saved locally and only affect the schedule page; shared images and widgets will continue to use the theme color.

source: 背景颜色
en_us: Background color

source: 自习安排
en_us: Study Resources

source: 自定义
en_us: Custom

source: 自定义：%@
en_us: Custom: %@

source: 自定义：%arg
en_us: Custom: %arg

source: 自定义主题色
en_us: Custom theme color

source: 自定义主题色会用于按钮、课程卡片和页面强调色。
en_us: Custom theme color will be used for buttons, course cards, and page highlight colors.

source: 自定义周次
en_us: Custom week

source: 自定义账号
en_us: Custom account

source: 自定日程
en_us: Custom Schedule

source: 舒适
en_us: Comfortable

source: 节
en_us: Session

source: 节次
en_us: Session Number

source: 节次：%@
en_us: Session Number: %@

source: 节次：第 %d 节
en_us: Session Number: Session %d

source: 节次：第 %d-%d 节
en_us: Period: Period %d-%d

source: 节次待定
en_us: Period to be determined

source: 英语
en_us: English

source: 范围
en_us: Scope

source: 草稿保存失败
en_us: Draft save failed

source: 草稿保存失败：%@
en_us: Draft save failed: %@

source: 草稿修改尚未保存
en_us: Draft modifications have not been saved

source: 草稿图片“%@”已丢失，请移除后重试。
en_us: Draft image “%@” is missing, please remove and try again.

source: 草稿图片“%@”无法读取，请移除后重试。
en_us: Draft image “%@” cannot be read, please remove and try again.

source: 草稿已不存在。
en_us: Draft no longer exists.

source: 草稿已保存
en_us: Draft saved

source: 草稿数据已损坏，无法读取。
en_us: Draft data is corrupted and cannot be read.

source: 草稿正文、图片和附件都会从本机删除，且无法恢复。
en_us: Draft content, images, and attachments will be deleted from this device and cannot be recovered.

source: 草稿箱
en_us: Draft Box

source: 草稿箱，%lld 篇未发布内容
en_us: Draft box, %lld unpublished content

source: 草稿箱，暂无草稿
en_us: Draft box, no drafts yet

source: 草稿读取失败，无法安全覆盖原文件。
en_us: Draft read failed, unable to safely overwrite the original file.

source: 草稿附件“%@”已丢失，请重新添加。
en_us: Draft attachment “%@” is missing, please re-add it.

source: 荣誉记录
en_us: Honor Records

source: 荣誉记录操作失败
en_us: Failed to operate on honor records

source: 获取最新成绩
en_us: Get Latest Grades

source: 获取成绩失败：%@
en_us: Failed to get grades: %@

source: 获取课表失败，已继续显示本地缓存：%@
en_us: Failed to get schedule, continuing to display local cache: %@

source: 获取课表失败：%@
en_us: Failed to get schedule: %@

source: 行内代码
en_us: Inline Code

source: 补充具体的问题或经验，便于他人回复。
en_us: Provide specific questions or experiences to facilitate others’ responses.

source: 补充说明
en_us: Additional Notes

source: 补记一次
en_us: Make a Supplementary Record

source: 补记会按日期自动归入对应的两周周期，假期周不会计入。
en_us: Supplementary records will be automatically assigned to the corresponding two-week cycle according to date. Holiday weeks are not counted.

source: 补记阳光长跑
en_us: Supplementary Sunshine Run

source: 裁切主页背景
en_us: Crop homepage background

source: 裁切头像
en_us: Crop avatar

source: 规则网页
en_us: Rules Webpage

source: 规则设置
en_us: Rule Settings

source: 计入统计
en_us: Counted in statistics

source: 记录
en_us: Records

source: 记录一段学习时间后，会在这里看到今日、本周和总时长。
en_us: After recording a study session, you will see today's, this week's, and total duration here.

source: 记录一段学习时间后，会在这里看到当前空间的累计时长。
en_us: After recording a period of study time, you will see the cumulative duration of the current space here.

source: 记录习惯
en_us: Recording habits

source: 记录了 %d 天，共 %d 条随记
en_us: Recorded on %d day(s), %d note(s) total

source: 记录仅保存在当前设备 · 由 MyLeafy 生成
en_us: Records are only saved on the current device · Generated by MyLeafy

source: 记录会在未来的今天与你重逢。
en_us: Records will reunite with you on this day in the future.

source: 记录最多的一天
en_us: Day with the most records

source: 记录多一些后，这里会显示你的常用时间。
en_us: Record more often to see your usual time here.

source: 记录天数
en_us: Recording days

source: 记录日迹
en_us: Daily Records

source: 记录日迹图片
en_us: Daily Record Images

source: 记录里程碑
en_us: Record Milestones

source: 记点什么...
en_us: Jot Something...

source: 设备可用空间不足，无法暂存这些文件。
en_us: Not enough device space to temporarily store these files.

source: 设置已保存。
en_us: Settings saved.

source: 设置截止日期
en_us: Set Deadline Date

source: 设置截止时间
en_us: Set Deadline Time

source: 设置报销截止日
en_us: Set Reimbursement Deadline

source: 评价相关
en_us: Ratings

source: 评分分布
en_us: Score Distribution

source: 评分已保存。
en_us: Rating saved.

source: 评教、评课和评菜属于学校社区能力，需要先进入对应学校社区。
en_us: Teaching, course, and food reviews belong to the school community capability and require entering the corresponding school community first.

source: 评教评课评菜
en_us: Teaching, Course, and Food Reviews

source: 评论内容不能为空。
en_us: Comment content cannot be empty.

source: 评论前需要先同意社区条款。
en_us: You need to agree to the community terms before commenting.

source: 评论前需要先完善社区资料。
en_us: You need to complete your community profile before commenting.

source: 评论区
en_us: Comment Section

source: 评论发布成功。
en_us: Comment posted successfully.

source: 评论已删除。
en_us: Comment deleted.

source: 评论操作
en_us: Comment Operations

source: 诊断或病情备注
en_us: Diagnosis or Medical Notes

source: 试试清除筛选或换一个关键词。
en_us: Try clearing the filter or changing the keyword.

source: 诗境 Poemery
en_us: Poemery

source: 该功能只适用于北京林业大学官方学院规则，通用入口不会套用北林细则。
en_us: This feature only applies to the official college rules of Beijing Forestry University; the general entry will not apply BIFT-specific rules.

source: 该用户尚未填写签名
en_us: This user has not filled in a signature

source: 该部分主要为表格内容，已在学分要求中整理。
en_us: This section mainly contains table content, which has been organized in the credit requirements.

source: 语言
en_us: Language

source: 请下拉刷新
en_us: Please pull down to refresh

source: 请先填写反馈内容。
en_us: Please fill in feedback content first.

source: 请先查询教室占用情况
en_us: Please check classroom occupancy first

source: 请先连接校园网登录教务系统。
en_us: Please connect to the campus network to log in to the academic system first.
